#+STARTUP: showall
#+STARTUP: lognotestate
#+TAGS: research(r) uvic(u) today(y) todo(t) cooking(c)
#+SEQ_TODO: TODO(t) STARTED(s) DEFERRED(r) CANCELLED(c) | WAITING(w) DELEGATED(d) APPT(a) DONE(d)
#+DRAWERS: HIDDEN STATE
#+ARCHIVE: %s_done::
#+TITLE: 
#+CATEGORY: 
#+PROPERTY: header-args:sql             :engine postgresql  :exports both :cmdline csc370
#+PROPERTY: header-args:sqlite          :db /path/to/db  :colnames yes
#+PROPERTY: header-args:C++             :results output :flags -std=c++17 -Wall --pedantic -Werror
#+PROPERTY: header-args:R               :results output  :colnames yes
#+PROPERTY: header-args:python          :results output  :exports both
#+OPTIONS: ^:nil

* On python


- The syntax requires to add self to any class method:
- And any class attribute should be prefixed with self

  #+begin_src python :results output
  class Person:
    def __init__(selfy, name, age):
      selfy.name = name
      selfy.age = age

    def myfunc(selfy):
      print("Hello my name is " + selfy.name)

    def mystatic():
      print("I don't have a name")

  Person.mystatic()
  p1 = Person("John", 36)
  p1.myfunc()
  #  p1.mystatic()
  #+end_src  

  #+RESULTS:
  #+begin_example
  I don't have a name
  Hello my name is John
  #+end_example

More oddities:


#+begin_src python :results output
def myfunc(selfy):
   print("Hello my name is " + selfy.name)

class Dog:
   def __init__(selfy, name, age):
      selfy.name = name
#   myfunc = myfunc

class Person:
   def __init__(selfy, name, age):
      selfy.name = name
#   myfunc = myfunc
      

p1 = Person("John", 36)
p1.myfunc()
    #  p1.mystatic()
  #+end_src  

  #+RESULTS:



* python: setters and getters

#+begin_src python :results output
class Person:
    
    species = 'Human'
    def __init__ (selfy, first, last):
        selfy.first = first
        selfy.last = last

    
print(Person.species)
p1 = Person ('Ellen', 'Ripley')
print(p1.first)
print(p1.last)
p1.last = 'Weaver'
print(p1.last)
#+end_src

#+RESULTS:
#+begin_example
Human
Ellen
Ripley
Weaver
#+end_example


#+begin_src python :results output
class Person:
    def __init__ (selfy, first, last):
        selfy.first = first
        selfy.__last__ = last

    def last(selfy):
        return selfy.__last__
    

p1 = Person ('Ellen', 'Ripley')
print(p1.first)
print(p1.last())
p1.last = 'Weaver'
print(p1.last)
#print(p1.last())
#+end_src

#+RESULTS:
#+begin_example
Ellen
Ripley
Weaver
#+end_example

#+begin_src python :results output 
class Person:
    def __init__ (self, first, last):
        self.first = first
        self.__last__ = last

    @property
    def last(self):
        return self.__last__
    

p1 = Person ('Ellen', 'Ripley')
print(p1.first)
print(p1.last)
#p1.last = 'Weaver'
#print(p1.last)
#+end_src

#+RESULTS:
#+begin_example
Ellen
Ripley
#+end_example


#+begin_src python :results output 
class Person:

    

    def __init__ (self, first, last):
        self.first = first
        self.__last__ = last

    @property
    def last(self):
        return self.__last__

    @last.setter
    def last(self, newLast):
        self.__last__ = newLast
    

p1 = Person ('Ellen', 'Ripley')
print(p1.first)
print(p1.last)
p1.last = 'Weaver'
print(p1.last)
#+end_src

#+RESULTS:
#+begin_example
Ellen
Ripley
Weaver
#+end_example


